#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.cliente will be created
  + resource "aws_dynamodb_table" "cliente" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "cpf"
      + id               = (known after apply)
      + name             = "cliente"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "cliente-tabela"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "cliente-tabela"
        }
      + write_capacity   = 20

      + attribute {
          + name = "cpf"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.pagamento will be created
  + resource "aws_dynamodb_table" "pagamento" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "ID"
      + id               = (known after apply)
      + name             = "pagamento"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "pagamento-tabela"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "pagamento-tabela"
        }
      + write_capacity   = 20

      + attribute {
          + name = "ID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.pedido will be created
  + resource "aws_dynamodb_table" "pedido" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "pedido"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "pedido-tabela"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "pedido-tabela"
        }
      + write_capacity   = 20

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "status"
          + name               = "status-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = 10
          + write_capacity     = 10
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.produto will be created
  + resource "aws_dynamodb_table" "produto" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "produto"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "produto-tabela"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "produto-tabela"
        }
      + write_capacity   = 20

      + attribute {
          + name = "categoria"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "categoria"
          + name               = "categoria-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = 10
          + write_capacity     = 10
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*